[
  {"id": 98,
  "type": "starter",
  "title": "Home Shield",
  "description": "HomeShield are Irelands leading 24/7 home emergency repair service. They use a network of HomeShield approved engineers around the country, in order to provide a local responsive service for all their customers. Homeshield services include home emergency cover, boiler cover, appliance cover, complete cover and landlord cover",
  "link": "http://bit.ly/2wltDjJ",
  "linktitle": " - View Post",
  "image":"https://scontent-lhr3-1.xx.fbcdn.net/v/t1.0-9/20620886_1477392445682224_2471886289696770783_n.jpg?oh=21887bd0ab3372225b7d811a67ab34d7&oe=5A2BE505"},
  {"id": 99,
  "title": "Property Solutions & Services",
  "description": "Property Solution and Services are Ireland’s first complete outsourcing company for residential lettings agencies. offering a wide range of services, from tenant referencing to property maintenance and home emergency cover. whether you are looking for a one-off post tenancy clean up or a managed inventory and inspection service, property solution and services can assist you with your rental property portfolio.",
  "link": "http://bit.ly/2uYGklb",
  "linktitle": " - View Post",
  "image":"https://scontent-lhr3-1.xx.fbcdn.net/v/t1.0-0/p240x240/20479728_1477378129016989_6021082614239601366_n.jpg?oh=1353cb8cbbe62655394ec0c5288f0591&oe=5A33FB75"},
    {"id": 100,
    "title": "Working with Angular 2 & Bootstrap 4 Alpha",
    "description": "Creating the app module along with the app component and app routing to progress to adding Bootstrap4 nav as parent links and footer to complete the first stage. Second stage involved creating new component for secondary child links and setting a new routing system for parent child links. Items from components and routing had to exported and imported from the relevant files in which declarations, imports from components and @angular, also from *.component.ts the selector, templateUrl and StyleUrl where set.",
    "link": "http://bit.ly/2l8q1kj",
    "linktitle": " - View Post",
    "image":"https://scontent-lhr3-1.xx.fbcdn.net/v/t1.0-9/16386938_1296859253735545_7019001338786081681_n.jpg?oh=cb0ac78425d07cb603338bb56c807d7d&oe=59F444D2"},
    {"id": 101,
    "title": "Single Page Demo Responsive Webpage using PostCSS",
     "description": " This development was undertaken to learn PostCSS which powers an unlimited variety of plugins that read and manipulate CSS. Using SASS type features of variables(fonts, @media, color), @imports, @define-mixins, functions, image, calc() and Autoprefixer to process CSS and minify it with cssnano along with gulp to activate the processes. Setup of the project was done with Gitbash through node and npm installing the node modules needed to work with the CSS manipulation. The setup included three folders Builds, node-modules and Process. The builds folder contained the main index.html file, images folder and outputed minified css stylesheet(which was setup in the gulpfile for the destination output)",
     "link": "http://bit.ly/1RoGvJ7",
     "linktitle": " - View Post",
     "image":"https://scontent-lhr3-1.xx.fbcdn.net/v/t1.0-9/12799168_1006652899422850_8886516712823043191_n.jpg?oh=3fc2c2d2a698e9b0b3c25884604ed041&oe=59FE2E74"},
    {"id": 102,
     "title": "Business Demo App",
      "description": "The business App is a complete new design and build and was created using Ionic framework using Angular.js, ngCordova, JSON, PHP and Bootstrap. This services App is responsive to mobile & tablet devices. It also allows for smooth flow from pages to partials area with user friendly designed access buttons.",
       "link": "http://bit.ly/1nKtbYs",
       "linktitle": " - View Post",
       "image":"https://scontent-lhr3-1.xx.fbcdn.net/v/t1.0-9/12661996_986963528058454_6277175096060987380_n.jpg?oh=d1ff36a4e1ddeedf6fa7f768af274c7c&oe=5A0022A1"},
    {"id": 103, "title": "Ionic-Angular-Cordova App setup and development",
    "description": "To create this project several packages needed to be installed to acquire the environment for development. Starting with Node.js as the main environment for setup for packages and dependencies. The Ionic Framework needs the Apache Cordova component to be installed. Cordova allows the Angular extensions to easily access the full native functionality of the device using Cordova/Phonegap plugins. Setup included several files such as: bower.json - bower dependencies, config.xml - cordova configuration, hooks - custom cordova hooks to execute specific commands, ionic project - ionic component files, package.json - Node dependencies, plugins - ionic / cordova plugins are installed. After setting up the project I began researching and reading the documentation for Ionic on layout and development with Angular.js. I started by creating the main page index.html and in the head tags of the html page i added the links and scripts needed for functionallity...",
    "link": "http://bit.ly/1Tccfr4",
    "linktitle": "Read More...",
    "image":"https://scontent-lhr3-1.xx.fbcdn.net/v/t1.0-9/12791104_1003252939762846_7997834641586024026_n.png?oh=a79d4ff91d38e95f6a5c71352dde4ed1&oe=59FD119F"}
]
